#ifndef __COMMON_H__
#define __COMMON_H__

/*
**********************************************************************
*                         头文件包含
**********************************************************************
*/
#include <reg52.h>
#include <intrins.h>
#include <math.h>

/*
**********************************************************************
*                         本地宏定义
**********************************************************************
*/

//sbit	Led2 = P2^0;	//按键S16中断测试Led
//sbit	CT_Led3 = P2^1;	//继电器开关测试Led
//sbit	Led4 = P2^3;    //定时中断测试Led
//sbit	Led5 = P2^4;    //按键S15中断测试Led
sbit 	CT_Time = P3^2;	//控制定时器中断
sbit	send_T = P3^3;  //S16发温度

sbit	CT_Led2 = P2^0;	//继电器开关测试Led
sbit	Led3 = P2^1;    //按键S15中断测试Led
sbit	Led4 = P2^2;	//按键S16中断测试Led
sbit	Led5 = P2^3;    //定时中断测试Led






/*
**********************************************************************
*                         自定义类型声明
**********************************************************************
*/
typedef unsigned char u8; 		// 重命名类型u8简化代码编写
typedef unsigned int u16;








#endif
